{"data":{"site":{"siteMetadata":{"title":"Evolution Of A Studio","author":"Janice Leng"}},"markdownRemark":{"id":"3fd8730c-2718-50c9-aa72-36d8120651fb","html":"<p>Our first, official “Crappy Dinner Party” was a few months after moving into the studio apartment. I was inspired by an article in <a href=\"https://www.thekitchn.com/5-rules-for-hosting-a-crappy-dinner-party-235815\">The Kitchn</a> to focus on hosting our friends, and not on  the dinner, the party, or the state of the apartment. We took this concept to heart and immediately invited our friends over. We expanded our dining table, and unfolded 4 folding chairs.</p>\n<p>Folding chairs are affordable space-savers when you still want extra seating. They would’ve fit in our closet, but we tucked ours behind our rocking chair by the window because we were using them so often at the time.</p>\n<p>We ordered in Thai food via <a href=\"http://www.seamless.com\">Seamless</a> (a popular food delivery app in NYC), and drank the leftover alcohol from our wedding. Cheers to crappy dinner parties in small spaces and to friends who love you all the more for ‘em!⠀</p>","excerpt":"Our first, official “Crappy Dinner Party” was a few months after moving into the studio apartment. I was inspired by an article in  The…","fields":{"slug":"/blog/the-crappy-dinner-party-pre-baby/"},"frontmatter":{"title":"The crappy dinner party (pre-baby)","date":"August 04, 2018","image":null,"images":[{"relativePath":"blog/the-crappy-dinner-party-pre-baby/after.png","publicURL":"/static/after-be5ce7070b33ae0d9dc303c285db9787.png"},{"relativePath":"blog/the-crappy-dinner-party-pre-baby/before.png","publicURL":"/static/before-b70013114083f5ddcf2319b8f5389103.png"}]}}},"pageContext":{"slug":"/blog/the-crappy-dinner-party-pre-baby/","previous":{"excerpt":"A few weeks ago, I was diagnosed with Bell’s Palsy. I woke up with my left face partially paralyzed. I couldn’t purse my lips to spit water…","fields":{"slug":"/blog/the-acupuncture-clinic/"},"frontmatter":{"title":"The acupuncture clinic","date":"August 01, 2018","categories":["floorplans"]}},"next":{"excerpt":"We decided to give our coffee table away. It seems like a small change, but it really affects how we interact with our space. The open…","fields":{"slug":"/blog/the-coffee-table-must-go/"},"frontmatter":{"title":"The coffee table must go","date":"August 06, 2018","categories":["floorplans"]}}}}