{"data":{"site":{"siteMetadata":{"title":"Evolution Of A Studio","author":"Janice Leng"}},"markdownRemark":{"id":"ce519ea2-1a11-5fb3-8070-72173dc39187","html":"<p>A few weeks ago, I was diagnosed with Bell’s Palsy. I woke up with my left face partially paralyzed. I couldn’t purse my lips to spit water while brushing my teeth. Water went in my left eye while showering because I couldn’t blink fully. I called my dad, a doctor of Traditional Chinese Medicine. He booked a flight and came to NY to give me acupuncture treatment. I’m pretty lucky because he’s truly one of the best at what he does. We transformed our studio apartment into a pop-up acupuncture clinic – on our dining room table! Even our dimmable pendant lamp above the dining room table served as a perfect light source for our pseudo-examination table.</p>\n<p>Today, my condition has improved greatly! Luckily, Bell’s Palsy can be treated fully, as long as you take quick action. Note: I also saw a general practitioner and I took corticosteroids and anti-viral medication as well, which is also vital to a full and speedy recovery.</p>","excerpt":"A few weeks ago, I was diagnosed with Bell’s Palsy. I woke up with my left face partially paralyzed. I couldn’t purse my lips to spit water…","fields":{"slug":"/blog/the-acupuncture-clinic/"},"frontmatter":{"title":"The acupuncture clinic","date":"August 01, 2018","image":null,"images":[{"relativePath":"blog/the-acupuncture-clinic/after.png","publicURL":"/static/after-ad00309f419958047d44b57f202cc94c.png"},{"relativePath":"blog/the-acupuncture-clinic/before.png","publicURL":"/static/before-d0685847ca49cb6a12c54b51b9f0c322.png"}]}}},"pageContext":{"slug":"/blog/the-acupuncture-clinic/","previous":{"excerpt":"Becoming a new mom meant I wanted to experience all the things I associated with motherhood. That meant I HAD to have a traditional crib…","fields":{"slug":"/blog/the-king-size-bed-share/"},"frontmatter":{"title":"The king-size bed share","date":"July 28, 2018","categories":["floorplans"]}},"next":{"excerpt":"Our first, official “Crappy Dinner Party” was a few months after moving into the studio apartment. I was inspired by an article in  The…","fields":{"slug":"/blog/the-crappy-dinner-party-pre-baby/"},"frontmatter":{"title":"The crappy dinner party (pre-baby)","date":"August 04, 2018","categories":["floorplans"]}}}}