{"data":{"site":{"siteMetadata":{"title":"Evolution Of A Studio","author":"Janice Leng"}},"markdownRemark":{"id":"82767faa-39f5-5b7e-9c57-80fbc6011afc","html":"<p>Becoming a new mom meant I wanted to experience all the things I associated with motherhood. That meant I HAD to have a traditional crib, even though a) we don’t have much space and b) we considered the possibility of bed-sharing before the baby came along. For those of us unfamiliar with the term, bed-sharing is the practice of having your baby sleep in the same bed as you. (Note: The AAP doesn’t recommend bed-sharing. We did our own research, however, and felt confident that bed-sharing was the right decision for us.) Sure enough, our little baby rarely used the crib. Four months in, we were fully committed to bed-sharing. We were ready for a floorplan update.⠀\n⠀\nBecause of an awkward column in the corner of our alcove, we couldn’t fit a normal king-size bed in our apartment. But we really needed a king to make bed-sharing more comfortable for us. We resorted to creating a CUSTOM king-size bed. <em>Cue IKEA hack</em> Materials: One LACK coffee table, one LACK side table, and a mini crib mattress from Amazon. We switched our sleeping orientation, and suddenly we had MORE than enough space for the three of us. Sweet dreams from our studio to yours!</p>","excerpt":"Becoming a new mom meant I wanted to experience all the things I associated with motherhood. That meant I HAD to have a traditional crib…","fields":{"slug":"/blog/the-king-size-bed-share/"},"frontmatter":{"title":"The king-size bed share","date":"July 28, 2018","image":null,"images":[{"relativePath":"blog/the-king-size-bed-share/after.png","publicURL":"/static/after-fe3c709c81a866d697456ab9ef7145a0.png"},{"relativePath":"blog/the-king-size-bed-share/before.png","publicURL":"/static/before-a8b1c444b41e310556d90d95622c2288.png"}]}}},"pageContext":{"slug":"/blog/the-king-size-bed-share/","previous":{"excerpt":"When we got married, I brought my full size mattress with me. We kept it for our overnight guests, instead of getting an air mattress…","fields":{"slug":"/blog/how-we-store-a-king-mattress-under-a-queen-bed/"},"frontmatter":{"title":"How we store a king mattress under a queen bed","date":"July 21, 2018","categories":["ideas"]}},"next":{"excerpt":"A few weeks ago, I was diagnosed with Bell’s Palsy. I woke up with my left face partially paralyzed. I couldn’t purse my lips to spit water…","fields":{"slug":"/blog/the-acupuncture-clinic/"},"frontmatter":{"title":"The acupuncture clinic","date":"August 01, 2018","categories":["floorplans"]}}}}