{"data":{"site":{"siteMetadata":{"title":"Evolution Of A Studio","author":"Janice Leng"}},"markdownRemark":{"id":"164151bc-acdb-58d6-bf07-4d2ff97e4cb5","html":"<p>Two years ago, our apartment looked SO different. We had just moved in with furniture that was catered to our previous 1BR apartment in Chelsea. On top of that, we had some hard “must-haves” for the new setup.</p>\n<p>Husband’s must-have: He really wanted to be able to look out the window, but not obstruct access to the window, while also not facing a wall while working at his desk. That was a must from our previous living situation that he didn’t want to give up.</p>\n<p>My must-have: I wanted to keep most, if not all, of our old furniture. I needed to make it work! But I also wanted to de-emphasize the sleeping quarters as much as possible. I didn’t want it to “feel” like a studio.</p>\n<p>Both these must-haves made for a really awkward Version 1.0. We kept the king size bed (bc who doesn’t love being able to eagle spread on clean sheets), but it was unavoidably large and visible from every angle it seemed. And in lieu of the wall, our desk faced… the bed? <em>facepalm</em> Has anyone else made some VERY questionable furniture arrangement decisions that seemed like a great idea at the time?</p>\n<p>As you can see already from previous posts, we have made some dramatic changes to our layout. Our priorities and sensibilities have since evolved. Follow us for more transformations!</p>","excerpt":"Two years ago, our apartment looked SO different. We had just moved in with furniture that was catered to our previous 1BR apartment in…","fields":{"slug":"/blog/version-1.0/"},"frontmatter":{"title":"Version 1.0","date":"August 27, 2018","image":null,"images":[{"relativePath":"blog/version-1.0/after.png","publicURL":"/static/after-bd6ab4ec39da539f5de0cd27ef0f4f9e.png"}]}}},"pageContext":{"slug":"/blog/version-1.0/","previous":{"excerpt":"We decided to give our coffee table away. It seems like a small change, but it really affects how we interact with our space. The open…","fields":{"slug":"/blog/the-whiteboard-mock-interview/"},"frontmatter":{"title":"The whiteboard mock interview","date":"August 20, 2018","categories":["floorplans"]}},"next":{"excerpt":"Before we bought this place, one of the drawbacks (for me) was that the apartment only had one row of windows on ONE wall. It wasn’t a deal…","fields":{"slug":"/blog/how-we-use-mirrors-to-fake-a-view/"},"frontmatter":{"title":"How we use mirrors to fake a view","date":"September 04, 2018","categories":["ideas"]}}}}