{"data":{"site":{"siteMetadata":{"title":"Evolution Of A Studio","author":"Janice Leng"}},"markdownRemark":{"id":"a5da93f1-4858-506f-b7f2-f0973d6615a8","html":"<p>Before we had a baby, my husband felt compelled to make a career move that would help us on our path to financial independence (retirement)! He wanted a job that would ultimately allow us to spend more time together as a family.</p>\n<p>He’s a software engineer (so am I), and engineering interviews are pretty intense. They consist of the usual soft-skills, culture-fit interview, but then there’s the dreaded whiteboard interview where prospective candidates have to answer coding problems on the spot. He was serious about this career move though, enough to purchase a large whiteboard and bolt it into the wall.* He had friends come over and conduct mock interviews and he would practice presenting his process and solutions on the whiteboard.</p>\n<p>After he got the job, we dismantled the whiteboard, but kept it and have been hiding it under furniture. I’m not sure why we’re keeping it, to be honest. Stay tuned though. You never know when something in our apartment gets seriously de-prioritized on a dime.</p>\n<p>FYI: You can find whiteboard contact paper if you want a more temporary solution.</p>","excerpt":"Before we had a baby, my husband felt compelled to make a career move that would help us on our path to financial independence (retirement…","fields":{"slug":"/blog/the-whiteboard-mock-interview/"},"frontmatter":{"title":"The whiteboard mock interview","date":"August 20, 2018","image":null,"images":[{"relativePath":"blog/the-whiteboard-mock-interview/after.png","publicURL":"/static/after-b87861c35a3cff943143696b8be872ab.png"}]}}},"pageContext":{"slug":"/blog/the-whiteboard-mock-interview/","previous":{"excerpt":"We decided to give our coffee table away. It seems like a small change, but it really affects how we interact with our space. The open…","fields":{"slug":"/blog/the-coffee-table-must-go/"},"frontmatter":{"title":"The coffee table must go","date":"August 06, 2018","categories":["floorplans"]}},"next":{"excerpt":"Two years ago, our apartment looked SO different. We had just moved in with furniture that was catered to our previous 1BR apartment in…","fields":{"slug":"/blog/version-1.0/"},"frontmatter":{"title":"Version 1.0","date":"August 27, 2018","categories":["floorplans"]}}}}