{"data":{"site":{"siteMetadata":{"title":"Evolution Of A Studio","author":"Janice Leng"}},"markdownRemark":{"id":"c9f65ba2-ce3d-5d42-b239-221e49ed4357","html":"<p>Before we bought this place, one of the drawbacks (for me) was that the apartment only had one row of windows on ONE wall. It wasn’t a deal breaker though. After all, the windows were pretty large and the space was still well lit. But I’ll be frank; I still wanted more windows.</p>\n<p>So here’s a trick we picked up from our entrepreneur friend <a href=\"https://www.instagram.com/alexisdamen/\">Alexis Damen</a>, creator of <a href=\"https://www.instagram.com/allnaturalproject/\">All Natural Project</a> (I’m featured in one of her posts btw so check it out)! We visited their apartment in Brooklyn, and I noticed their place felt airier than the last time we were there. It turns out the only difference was a mirror hung RIGHT next to the windows on the adjacent wall. I thought it was another window! It let more light in, and added more dimension to their space.</p>\n<p>Even if you don’t want to fake a corner window view, a mirror on the adjacent wall is a generally a good spot to reflect light back into a room. We chose a tall mirror that mimics the dimensions of one of our windows. It was very affordable (another IKEA purchase ftw) and satisfies my inner/outer desire for more windows in the studio apartment.</p>\n<p>FYI we have 3 more mirrors hanging strategically in our apartment. More on that in a later post.</p>","excerpt":"Before we bought this place, one of the drawbacks (for me) was that the apartment only had one row of windows on ONE wall. It wasn’t a deal…","fields":{"slug":"/blog/how-we-use-mirrors-to-fake-a-view/"},"frontmatter":{"title":"How we use mirrors to fake a view","date":"September 04, 2018","image":null,"images":[{"relativePath":"blog/how-we-use-mirrors-to-fake-a-view/01.png","publicURL":"/static/01-95a512f05c6de9e16bcd5c31acc98731.png"},{"relativePath":"blog/how-we-use-mirrors-to-fake-a-view/02.png","publicURL":"/static/02-ea7db932edc22f62e4df0e2b4f65adca.png"},{"relativePath":"blog/how-we-use-mirrors-to-fake-a-view/03.png","publicURL":"/static/03-d9f476cfccc4ddfa85297f9970c8486d.png"}]}}},"pageContext":{"slug":"/blog/how-we-use-mirrors-to-fake-a-view/","previous":{"excerpt":"Two years ago, our apartment looked SO different. We had just moved in with furniture that was catered to our previous 1BR apartment in…","fields":{"slug":"/blog/version-1.0/"},"frontmatter":{"title":"Version 1.0","date":"August 27, 2018","categories":["floorplans"]}},"next":null}}